In [22]:
# create a small dictionary
# names of 4 students, and their marks
# key : value 

students_dict = {
    "Ben":90, 
    "Mark":88, 
    "Jeff":55, 
    "Bob":75
}
print(students_dict)
students_dict["Ben"]

{'Ben': 90, 'Mark': 88, 'Jeff': 55, 'Bob': 75}

90

In [29]:
students_grades = {
    "name": ["Idrees","Mel","Ibrahim","Hazira","Amin","Nazri"],
    "maths":[90,90,90,92,94,94],
    "english": [90,90,90,92,94,94],
    "science": [90,90,90,92,94,94]
}

print(students_grades)

{'name': ['Idrees', 'Mel', 'Ibrahim', 'Hazira', 'Amin', 'Nazri'], 'maths': [90, 90, 90, 92, 94, 94], 'english': [90, 90, 90, 92, 94, 94], 'science': [90, 90, 90, 92, 94, 94]}

In [34]:
print(students_grades["maths"])

students_grades["name"][2] = "Aatirah"
students_grades["name"][2]

[90, 90, 90, 92, 94, 94]

'Aatirah'

In [ ]:
pip install pandas --upgrade pip # type: ignore

In [41]:
import pandas as pd

df = pd.DataFrame(students_grades)

df
print("\n first table ------------\n",df, "\n")
print("\n second table ------------\n",df, "\n")
print("\n third table ------------\n",df)

 first table ------------
       name  maths  english  science
0   Idrees     90       90       90
1      Mel     90       90       90
2  Aatirah     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94


 second table ------------
       name  maths  english  science
0   Idrees     90       90       90
1      Mel     90       90       90
2  Aatirah     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94


 third table ------------
       name  maths  english  science
0   Idrees     90       90       90
1      Mel     90       90       90
2  Aatirah     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94

In [26]:
type(df)

#numpy.ndarray

pandas.core.frame.DataFrame

In [42]:
df.head() # top part of a df # 5 is the default argument
df.tail()

      name  maths  english  science
1      Mel     90       90       90
2  Aatirah     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94

In [43]:
# we can access certain columns in dataframes too

print("\n Names column ------------\n",df["name"])
print("\n maths column ------------\n",df["maths"])
#print("\n english column ------------\n",df["english"])
# print("\n science column ------------\n",df["science"])

 Names column ------------
 0     Idrees
1        Mel
2    Aatirah
3     Hazira
4       Amin
5      Nazri
Name: name, dtype: object

 maths column ------------
 0    90
1    90
2    90
3    92
4    94
5    94
Name: maths, dtype: int64

In [44]:
import numpy as np
arrayyyy = np.array([])
type(arrayyyy)

numpy.ndarray

In [ ]:
# series

marks_series = pd.Series([1,2,3,4,5])
#type(marks_series)

print(marks_series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:

english_amin = df['english'][4]

print(english_amin)

94

In [ ]:
at = df["name"][2]
at_english = df["english"][2]

print(f" In English {at} had {at_english} marks")

 In English Atheerah had 91 marks

In [ ]:
#core data types

#dataframe
#series

In [ ]:
temp_series = pd.Series([30,32,33,34,28])
type(temp_series)

print(temp_series)

0    30
1    32
2    33
3    34
4    28
dtype: int64

In [ ]:
temp_df = pd.DataFrame(city_temp)

print(temp_df)

    cities  temp
0    Delhi    25
1   Chenai    50
2  Kashmir    -1
3      Goa    28
4   Mumbai    22

In [ ]:
#series object - single columns, 1D column

temp11 = pd.Series([32,31,50,34,-2])
print("type pf temp11",type(temp11))

temperatures = {
    'cities' : ['KL','HK','SG','NY','HLS'],
    'temp10' : [23,29,40,0,5]
}

temp_df = pd.DataFrame(temperatures)
print('type of temp_df: ',type(temp_df))

print(temp_df)
print(temp11)

type pf temp11 <class 'pandas.core.series.Series'>
type of temp_df:  <class 'pandas.core.frame.DataFrame'>
  cities  temp10
0     KL      23
1     HK      29
2     SG      40
3     NY       0
4    HLS       5
0    32
1    31
2    50
3    34
4    -2
dtype: int64

In [ ]:
temp_df['temp22'] = temp11

temp_df

  cities  temp10  temp22
0     KL      23      32
1     HK      29      31
2     SG      40      50
3     NY       0      34
4    HLS       5      -2

In [ ]:
data = {
    'cities' : ['KL','KL','KL','NY','HLS'],
    'temp10' : [23,29,40,0,5]
}

df = pd.DataFrame(data)
df

  cities  temp10
0     KL      23
1     KL      29
2     KL      40
3     NY       0
4    HLS       5

In [ ]:
df['cities'].value_counts()

cities
KL     3
NY     1
HLS    1
Name: count, dtype: int64

In [ ]:
df['cities'].unique()

array(['KL', 'NY', 'HLS'], dtype=object)

In [ ]:
df['cities'].duplicated()

0    False
1     True
2     True
3    False
4    False
Name: cities, dtype: bool

In [ ]:
df['cities'].drop_duplicates()

0     KL
3     NY
4    HLS
Name: cities, dtype: object